In [3]:
import pandas as pd
import numpy as np
from numpy import nan
from pandas import Series,DataFrame
import os

# ▼DataFrame

データフレームの作り方
(1)DataFrame(列名：データ1,データ2,データ3)
(2)

In [6]:
os.chdir("C:/Users/Administrator/Documents/python")
pd.read_csv("sample.csv",encoding='shift-jis')

    Unnamed: 0 USER_ID ITEM_ID CATEGORY
0            1       A       a      ズボン
1            2       A       b      ズボン
2            3       A       a      ズボン
3            4       B       b      ズボン
4            5       B       d      ズボン
5            6       C       c      ズボン
6            7       C       e      ズボン
7            8       D       c      ズボン
8            9       D       d      ズボン
9           10       D       e      ズボン
10          11       E       b      ズボン
11          12       E       c      ズボン
12          13       F       a      ズボン
13          14       F       b      ズボン
14          15       F       d      ズボン
15          16       F       e      ズボン
16          17       G       a      ズボン
17          18       G       c      ズボン
18          19       H       g      ズボン
19          20       A       a      シャツ
20          21       A       c      シャツ
21          22       A       d      シャツ
22          23       B       a      シャツ
23          24       B       b      シャツ
24          25       C       b      シャツ
25          26       C       c      シャツ
26          27       D       a      シャツ
27          28       D       d      シャツ

In [8]:
pd.DataFrame(index = range(3), columns = column_csv.columns)

NameError: name 'column_csv' is not defined

In [80]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
df=DataFrame(data,columns=['year','state','pop'])
df

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [31]:
df=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])
df

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [46]:
#リストで数字を渡してあげると、列を指定
df[[0]]

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9

In [48]:
#カラム名を指定してもよい
df[['pop']]

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9

In [50]:
#これだとオブジェクトで返ってくる
df['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [ ]:
#リストの中に数字→NG
df[0]

In [29]:
#リストの中にリスト
df[[0]]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [28]:
#リストの中に文字列
df['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [30]:
#リストの中にリスト
df[['year']]

       year
one    2000
two    2001
three  2002
four   2001
five   2002

In [ ]:
df['year','state'] →NG

In [ ]:
#リストの中に2次元配列
df[['year'],['state']]　→　NG

In [35]:
#2つ以上取得したい場合はリストにして渡してあげる。
df[['year','state']]

       year   state
one    2000    Ohio
two    2001    Ohio
three  2002    Ohio
four   2001  Nevada
five   2002  Nevada

▼データを取り出す

# ixメゾット
##### 行を取り出すメゾット。方法としては、行ラベルを記載するか、行番号を入れるか。

In [8]:
df=pd.read_csv("sample.csv",encoding='shift-jis',index_col='USER_ID')
print(df)

        ITEM_ID CATEGORY
USER_ID
A             a      ズボン
A             b      ズボン
A             c      ズボン
B             a      ズボン
B             b      ズボン
C             c      ズボン
C             e      ズボン
D             c      ズボン
D             d      ズボン
D             e      ズボン
E             b      ズボン
E             c      ズボン
F             a      ズボン
F             b      ズボン
F             d      ズボン
F             e      ズボン
G             a      ズボン
G             c      ズボン
H             g      ズボン
A             h      シャツ
A             j      シャツ
A             k      シャツ
B             h      シャツ
B             i      シャツ
C             i      シャツ
C             j      シャツ
D             h      シャツ
D             k      シャツ

In [9]:
#引数1つなら「行」
df.ix[0]

ITEM_ID       a
CATEGORY    ズボン
Name: A, dtype: object

In [10]:
#引数2つなら「行」の次に「列」
print(df.ix[5,0])
print(df.ix[5,1])

print(df.ix[6,0])
print(df.ix[6,1])

c
ズボン
e
ズボン

In [11]:
print(df.ix[12,0])
print(df.ix[19,2])
print(df.ix[0:5,0])

a

IndexError: index out of bounds

In [41]:
df.ix[[0,0],[1,0]]

     pop debt
one  1.5  NaN
two  1.7  NaN

In [43]:
#ilocは行列番号で指定
df.iloc[[0,1],[2,3]]

     pop debt
one  1.5  NaN
two  1.7  NaN

In [44]:
df.loc[[0,1],[2,3]]

KeyError: 'None of [[0, 1]] are in the [index]'

In [45]:
df.loc[['one','two'],['pop','debt']]

     pop debt
one  1.5  NaN
two  1.7  NaN

# ▼データ確認系

In [54]:
#データの冒頭5行を取得
df.head(5)

#データの末尾5行を取得
df.tail(5)

#データフレーム全体のデータ型の確認
df.info()

#データの件数や統計量を確認
df.describe()

#データの型の確認
type(df)

#列のデータ型の確認
type(df['pop'])

#データ型の変更
#今回はprice列が文字列だったのでfloat型に変更
df['pop'] = df['pop'].astype(np.float64)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 4 columns):
year     5 non-null int64
state    5 non-null object
pop      5 non-null float64
debt     0 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 140.0+ bytes

In [12]:
df.dtypes

pop      float64
state     object
year       int64
dtype: object

# ▼merge

In [38]:
df1 = pd.DataFrame({'USER': [11, 21, 31],
                    'PRODUCT': [12, 22, 32],
                    'PRICE': [2000,3000,7000]},
                   index = ['I1', 'I2', 'I3'])

df2 = pd.DataFrame({'USER': [11, 21, 41],
                    'PRODUCT': [12, 42, 52]},
                   index = ['I1', 'I2', 'I3'])

In [39]:
df1

    PRICE  PRODUCT  USER
I1   2000       12    11
I2   3000       22    21
I3   7000       32    31

In [40]:
df2

    PRODUCT  USER
I1       12    11
I2       42    21
I3       52    41

In [42]:
pd.merge(df1,df2,left_on=['USER'],right_on=['USER'])

   PRICE  PRODUCT_x  USER  PRODUCT_y
0   2000         12    11         12
1   3000         22    21         42

In [75]:
pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='inner')

   PRICE  PRODUCT  USER
0   2000       12    11

In [76]:
pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='outer')

   PRICE  PRODUCT  USER
0   2000       12    11
1   3000       22    21
2   7000       32    31
3    NaN       42    21
4    NaN       52    41

In [77]:
pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='left')

   PRICE  PRODUCT  USER
0   2000       12    11
1   3000       22    21
2   7000       32    31

In [78]:
pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='right')

   PRICE  PRODUCT  USER
0   2000       12    11
1    NaN       42    21
2    NaN       52    41

In [79]:
df3=pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='inner')

# ▼where

In [2]:
s1 = pd.Series([1, 2, 3], index = ['I1', 'I2', 'I3'])

df1 = pd.DataFrame({'C1': [11, 21, 31],
                    'C2': [12, 22, 32],
                    'C3': [13, 23, 33]},
                   index = ['I1', 'I2', 'I3'])

In [3]:
s1

I1    1
I2    2
I3    3
dtype: int64

In [4]:
s1[s1>2]

I3    3
dtype: int64

In [5]:
s1.where(s1>2)

I1   NaN
I2   NaN
I3     3
dtype: float64

In [6]:
s1.where(s1>2,0)

I1    0
I2    0
I3    3
dtype: int64

In [7]:
s1.where(s1 > 2, np.array([4, 5, 6]))

I1    4
I2    5
I3    3
dtype: int64

In [8]:
s2 = pd.Series([4, 5, 6], index = ['I1', 'I2', 'I3'])

In [9]:
s1.where(s1 > 2, s2)

I1    4
I2    5
I3    3
dtype: int64

In [10]:
df1

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [11]:
df1.where(df1 > 22)

    C1  C2  C3
I1 NaN NaN NaN
I2 NaN NaN  23
I3  31  32  33

In [12]:
df1.where(df1 > 22,0)

    C1  C2  C3
I1   0   0   0
I2   0   0  23
I3  31  32  33

In [13]:
df2 = pd.DataFrame({'C1': [44, 54, 64],
                    'C2': [45, 55, 65],
                    'C3': [46, 56, 66]},
                   index = ['I1', 'I2', 'I3'])

In [14]:
df2

    C1  C2  C3
I1  44  45  46
I2  54  55  56
I3  64  65  66

In [15]:
df1.where(df1 > 22,df2)

    C1  C2  C3
I1  44  45  46
I2  54  55  23
I3  31  32  33

In [16]:
df1

    C1  C2  C3
I1  11  12  13
I2  21  22  23
I3  31  32  33

In [17]:
df1['C4'] = df1['C2'].where(df1['C2'] > 30,df2['C2'])

In [18]:
df1

    C1  C2  C3  C4
I1  11  12  13  45
I2  21  22  23  55
I3  31  32  33  32

# ▼余談

In [19]:
#TrueかFlaseでデータが返ってくる
df1 > 30

       C1     C2     C3    C4
I1  False  False  False  True
I2  False  False  False  True
I3   True   True   True  True

In [20]:
#bool型のTrueの部分だけが返ってくる
df1[df1 > 30]

    C1  C2  C3  C4
I1 NaN NaN NaN  45
I2 NaN NaN NaN  55
I3  31  32  33  32

# ▼mask

In [21]:
df1.where(df1>25)

    C1  C2  C3  C4
I1 NaN NaN NaN  45
I2 NaN NaN NaN  55
I3  31  32  33  32

In [22]:
df1.mask(df1>25)

    C1  C2  C3  C4
I1  11  12  13 NaN
I2  21  22  23 NaN
I3 NaN NaN NaN NaN

# ▼isin

In [23]:
df1

    C1  C2  C3  C4
I1  11  12  13  45
I2  21  22  23  55
I3  31  32  33  32

In [26]:
df1[df1.isin([22,23])]

    C1  C2  C3  C4
I1 NaN NaN NaN NaN
I2 NaN  22  23 NaN
I3 NaN NaN NaN NaN

In [35]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
df[df.isin(['Ohio'])]

   pop state  year
0  NaN  Ohio   NaN
1  NaN  Ohio   NaN
2  NaN  Ohio   NaN
3  NaN   NaN   NaN
4  NaN   NaN   NaN

# ▼contains

In [60]:
df['state'].str.contains('Ohio')

0     True
1     True
2     True
3    False
4    False
Name: state, dtype: bool

In [61]:
df[df['state'].str.contains('Ohio')]

   pop state  year
0  1.5  Ohio  2000
1  1.7  Ohio  2001
2  3.6  Ohio  2002

# ▼query

In [73]:
df[(df['pop']>=2.0) & (df['pop']<=3.0)]

   pop   state  year
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [74]:
df.query('pop >= 2.0 and pop < 3.0')

   pop   state  year
3  2.4  Nevada  2001
4  2.9  Nevada  2002

# ▼drop

In [85]:
df.drop((df['pop']>=2.0) & (df['pop']<=3.0))

   pop   state  year
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

TypeError: 'DataFrame' object is not callable

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

# ▼concat

In [86]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

In [91]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

In [95]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

In [89]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [92]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [94]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [96]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [97]:
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [98]:
pd.concat([df1,df4])

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

# ▼groupby

In [2]:
df=DataFrame({'key1':['a','a','b','b','a'],
              'key2':['one','two','one','two','one'],
              'data1':np.random.randn(5),
              'data2':np.random.randn(5)})

In [6]:
#一般的なグループ化
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.729422 -0.400378
     two   0.660954  0.342402
b    one   0.965934  0.232106
     two  -0.410911 -1.910696

In [7]:
#少し冗長なので…
df1=df[['key1','key2','data1']]
df1.groupby(['key1','key2']).mean()

              data1
key1 key2
a    one  -0.729422
     two   0.660954
b    one   0.965934
     two  -0.410911

In [8]:
#少し冗長なので…
df1=df[['key1','key2','data1']].groupby(['key1','key2']).mean()

In [3]:
#1行でやると…
df[['data1','key1','key2']].groupby(['key1','key2']).mean()

              data1
key1 key2
a    one  -0.729422
     two   0.660954
b    one   0.965934
     two  -0.410911

# ▼重複を全削除（パターン１）

In [99]:
df1 = pd.DataFrame({'USER': [11, 21, 31],
                    'PRODUCT': [12, 22, 32],
                    'PRICE': [2000,3000,7000]},                   
                   index = ['I1', 'I2', 'I3'])

df2 = pd.DataFrame({'USER': [11, 21, 41],
                    'PRODUCT': [12, 42, 52]},
                   index = ['I4', 'I5', 'I6'])

In [100]:
df1

    PRICE  PRODUCT  USER
I1   2000       12    11
I2   3000       22    21
I3   7000       32    31

In [101]:
df2

    PRODUCT  USER
I4       12    11
I5       42    21
I6       52    41

In [104]:
df3=pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='inner')
df3

   PRICE  PRODUCT  USER
0   2000       12    11

In [106]:
df4=pd.concat([df1,df3])
df4

    PRICE  PRODUCT  USER
I1   2000       12    11
I2   3000       22    21
I3   7000       32    31
0    2000       12    11

In [118]:
df4['COUNT']=1
df4

    PRICE  PRODUCT  USER  COUNT
I1   2000       12    11      1
I2   3000       22    21      1
I3   7000       32    31      1
0    2000       12    11      1

In [133]:
df5=DataFrame(df4.groupby(['USER','PRODUCT','PRICE']).sum())
df5

                    COUNT
USER PRODUCT PRICE
11   12      2000       2
21   22      3000       1
31   32      7000       1

In [134]:
df6=df5.reset_index()[['USER','PRODUCT','PRICE','COUNT']]
df6

   USER  PRODUCT  PRICE  COUNT
0    11       12   2000      2
1    21       22   3000      1
2    31       32   7000      1

In [132]:
df6[df6['COUNT']==1]

   USER  PRODUCT  PRICE  COUNT
1    21       22   3000      1
2    31       32   7000      1

# ▼重複を全削除（パターン2）

In [140]:
df3=pd.merge(df1,df2,left_on=['USER', 'PRODUCT'],right_on=['USER', 'PRODUCT'],how='right')
df3

   PRICE  PRODUCT  USER
0   2000       12    11
1    NaN       42    21
2    NaN       52    41

In [141]:
df3[df3['PRICE'].isnull()]

   PRICE  PRODUCT  USER
1    NaN       42    21
2    NaN       52    41

In [142]:
df4=df3[df3['PRICE'].isnull()]
df4

   PRICE  PRODUCT  USER
1    NaN       42    21
2    NaN       52    41

# ▼set_option

In [ ]:
#encoding='shift-jis'
os.chdir('C:/Users/Administrator/Documents/spss/18_pvpricedown')

# ▼ Not in

In [8]:
list=[]

In [10]:
list.append('A')

In [11]:
list

['A']

In [16]:
list=['A','B','C']

In [17]:
list

['A', 'B', 'C']

In [18]:
if 'A' not in list:
    print("yes")

In [20]:
if 'D' not in list:
    print("yes")

yes

In [21]:
if('D' not in list):
    print("yes")

yes

In [28]:
for i in df.index:
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27

In [29]:
for j in range(1,5):
    print(j)

1
2
3
4

# ▼indexメゾット

In [4]:
df=pd.read_csv("sample.csv",encoding='shift-jis',index_col='USER_ID')
print(df)

        ITEM_ID CATEGORY
USER_ID
A             a      ズボン
A             b      ズボン
A             c      ズボン
B             a      ズボン
B             b      ズボン
C             c      ズボン
C             e      ズボン
D             c      ズボン
D             d      ズボン
D             e      ズボン
E             b      ズボン
E             c      ズボン
F             a      ズボン
F             b      ズボン
F             d      ズボン
F             e      ズボン
G             a      ズボン
G             c      ズボン
H             g      ズボン
A             h      シャツ
A             j      シャツ
A             k      シャツ
B             h      シャツ
B             i      シャツ
C             i      シャツ
C             j      シャツ
D             h      シャツ
D             k      シャツ

In [5]:
df.index

Index(['A', 'A', 'A', 'B', 'B', 'C', 'C', 'D', 'D', 'D', 'E', 'E', 'F', 'F',
       'F', 'F', 'G', 'G', 'H', 'A', 'A', 'A', 'B', 'B', 'C', 'C', 'D', 'D'],
      dtype='object', name='USER_ID')

In [6]:
j=0

for i in df.index:
    j+=1
    print(str(j)+"周目")
    print(i)

1周目
A
2周目
A
3周目
A
4周目
B
5周目
B
6周目
C
7周目
C
8周目
D
9周目
D
10周目
D
11周目
E
12周目
E
13周目
F
14周目
F
15周目
F
16周目
F
17周目
G
18周目
G
19周目
H
20周目
A
21周目
A
22周目
A
23周目
B
24周目
B
25周目
C
26周目
C
27周目
D
28周目
D